config.org
*** Ensure blank lines between headings and before contents

From alphapapa.

#+begin_src elisp
(defun ap/org-fix-blank-lines (prefix)
  "Fix blank lines (or lack thereof) between entries and between planning-lines/drawers and entry contents in current subtree.
    With prefix, operate on whole buffer."
  (interactive "P")
  (save-excursion
    (when prefix
      (goto-char (point-min)))
    (when (org-before-first-heading-p)
      (outline-next-heading))
    (ap/org-fix-blank-lines-between-subtree-nodes)
    (ap/org-fix-blank-lines-after-headings)))
#+end_src

#+begin_src elisp
(defun ap/org-fix-blank-lines-between-subtree-nodes ()
  "Make sure each heading in subtree is separated from the previous heading's content by a blank line."
  (interactive)
  (save-excursion
    (unless (org-at-heading-p)
      (org-back-to-heading))
    (ignore-errors
      ;; Try to work on the parent-level heading to fix all siblings
      ;; of current heading, but if we're at a top-level heading,
      ;; ignore the error.
      (outline-up-heading 1))
    (let ((m (point-marker)))
      (cl-flet ((fix nil (while (not (looking-back "\n\n"))
                           (insert-before-markers "\n"))))
        (org-map-entries #'fix t 'tree))
      ;; Inserting blank lines may move the point, depending on whether
      ;; it was at the beginning of a heading line or somewhere else.
      ;; Use the marker to make sure we are at the same position.
      (goto-char m)
      (org-with-wide-buffer
       ;; `org-map-entries' narrows the buffer, so `looking-back'
       ;; can't see newlines before the top heading, which may cause
       ;; extra newlines to be inserted.  Now we clean them up.
       (outline-back-to-heading)
       (while (looking-back (rx (>= 3 "\n")))
         (delete-char -1 nil)))
      (set-marker m nil))))
#+end_src

#+begin_src elisp
(defun ap/org-fix-blank-lines-after-headings ()
  "Make sure a blank line exists after a heading's drawers and planning lines, before the entry content."
  (interactive)
  (when (org-before-first-heading-p)
    (user-error "Before first heading."))
  (cl-flet ((fix nil (let ((end (org-entry-end-position)))
                       (forward-line)
                       (while (and (org-at-planning-p)
                                   (< (point) (point-max)))
                         ;; Skip planning lines
                         (forward-line))
                       (while (re-search-forward org-drawer-regexp end t)
                         ;; Skip drawers.  You might think that
                         ;; `org-at-drawer-p' would suffice, but for
                         ;; some reason it doesn't work correctly
                         ;; when operating on hidden text.  This
                         ;; works, taken from
                         ;; `org-agenda-get-some-entry-text'.
                         (re-search-forward "^[ \t]*:END:.*\n?" end t)
                         (goto-char (match-end 0)))
                       (unless (or (= (point) (point-max))
                                   (org-at-heading-p)
                                   (looking-at-p "\n"))
                         (insert "\n")))))
    (org-map-entries #'fix t 'tree)))
#+end_src

by [[https://github.com/alphapapa/unpackaged.el#ensure-blank-lines-between-headings-and-before-contents][Alphapapa]]

*** Org directories and files :org:

If you use `org' and don't want your org files in the default location below, change `org-directory'. It must be set before org loads!

**** Org root directory :org:

The following will vary, so change it to be whatever your org root directory is/what you want it to be.

I use a directory that I sync between computers with a Nextcloud server I run but you don't necessarily have to do that.

#+begin_src elisp
;; (after! 'org
  (setq org-directory
        (concat
         (getenv "HOME")
        "/Nextcloud/documents/org/"))
  ;; )
#+end_src

**** Org bookmark directory :org:

The following will vary, so change it to be whatever your bookmarks file is/what you want it to be.

I use a document that I track with org roam but you don't necessarily have to do that.

#+begin_src elisp
(with-eval-after-load 'org
  (setq +org-capture-bookmarks-file
        (concat
         (getenv "HOME")
         "/Nextcloud/documents/org/roam/20221004090130-bookmarks.org")))
#+end_src

**** Org agenda files :org:

#+begin_src elisp
(setq org-agenda-files
   '("/home/chu/Nextcloud/documents/org/roam/20220726210346-important_dates.org"
     "/home/chu/Nextcloud/documents/org/roam/20220822103211-engl_1030.org"
     "/home/chu/Nextcloud/documents/org/roam/20220823133456-precalculus_algebra.org"
     "/home/chu/Nextcloud/documents/org/roam/20220826102105-chem_1115.org"
     "/home/chu/Nextcloud/documents/org/roam/20221002161631-my_conlang.org"
     "/home/chu/Nextcloud/documents/org/roam/20221002190906-furry.org"
     "/home/chu/Nextcloud/documents/org/roam/20221004221829-todo.org"
     "/home/chu/Nextcloud/documents/org/roam/20221004221831-todo.org"
     "/home/chu/Nextcloud/documents/org/roam/20221004222234-projects.org"
     "/home/chu/Nextcloud/documents/org/roam/20221004222237-journal.org"
     "/home/chu/Nextcloud/documents/org/roam/20221004222241-notes.org"
     "/home/chu/Nextcloud/documents/org/roam/20240201170253-albums_to_download.org"
     "/home/chu/Nextcloud/documents/org/roam/20240326161621-livestreaming.org"
     "/home/chu/Nextcloud/documents/org/roam/asm/20240830094040-assembly.org"
     "/home/chu/Nextcloud/documents/org/roam/c++/20240116111203-cpp.org"
     "/home/chu/Nextcloud/documents/org/roam/daily/2024-05-08.org"
     "/home/chu/Nextcloud/documents/org/roam/engl/engl-2020/20240116095712-engl_2020.org"
     "/home/chu/Nextcloud/documents/org/roam/hist/hist-2320/20240116133242-hist_2320.org"
     "/home/chu/Nextcloud/documents/org/roam/lisp/scheme/sicp/README.org"
     "/home/chu/Nextcloud/documents/org/roam/math/20220821114043-mathematics.org"
     "/home/chu/Nextcloud/documents/org/roam/math/20240903162832-linear_algebra.org"
     "/home/chu/Nextcloud/documents/org/roam/math/20240905211621-calculus_ii.org"
     "/home/chu/Nextcloud/documents/org/roam/20220726210347-important_dates.org"))
#+end_src

Usually, you just set these using `org-agenda-file-to-front`

**** Org capture journal file location :org:

You know the gist by now--change this to whatever you want your file to be.

#+begin_src elisp
(with-eval-after-load 'org
  (setq +org-capture-journal-file
        (concat
         (getenv "HOME")
         "/Nextcloud/documents/org/roam/20221004222230-journal.org")))
#+end_src

**** Org capture journal location :org:

#+begin_src elisp
(with-eval-after-load 'org
  (setq org-journal-dir
        (concat
         (getenv "HOME")
         "/Nextcloud/documents/org/roam/journal/")))
#+end_src

**** Org notes file location :org:

#+begin_src elisp
(with-eval-after-load 'org
  (setq +org-capture-notes-file
        (concat
         (getenv "HOME")
         "/Nextcloud/documents/org/roam/20221004222235-notes.org")))
#+end_src

**** Org projects file location :org:

#+begin_src elisp
(with-eval-after-load 'org
  (setq +org-capture-projects-file
        (concat
         (getenv "HOME")
         "/Nextcloud/documents/org/roam/20221004222226-projects.org")))
#+end_src

**** Org todo file location :org:

I primarily use a "todo" file rather than an "agenda" file, for agenda ("TODO") items.

#+begin_src elisp
(with-eval-after-load 'org
  (setq +org-capture-todo-file
        (concat
         (getenv "HOME")
         "/Nextcloud/documents/org/roam/20221004221829-todo.org")))
#+end_src

**** Org Roam v2 directories and files :org:roam:

#+begin_src elisp
;; (with-eval-after-load 'org
  (setq org-roam-directory
        (concat
         (getenv "HOME")
         "/Nextcloud/documents/org/roam/"))
;; )
#+end_src

**** Org Roam v2 dailies directory :org:roam:

Path to daily-notes. This path is relative to org-roam-directory.

#+begin_src elisp
(setq org-roam-dailies-directory "daily/")
#+end_src

**** Org Roam v2 dailies capture template :org:roam:

#+begin_src elisp
(setq org-roam-dailies-capture-templates
      '(("d" "default" entry
         "* %?"
         :target (file+head "%<%Y-%m-%d>.org"
                            "#+title: %<%Y-%m-%d>\n"))))
#+end_src

**** org-roam-protocol test :org:roam:protocols:

(I don't remember why I put this here.)

#+begin_src elisp
(require 'org-roam-protocol)
#+end_src

**** org-roam-export test :org:roam:

(I don't remember why I put this here, either.)

#+begin_src elisp
(require 'org-roam-export)
#+end_src

**** Org ID: Custom ID Location :org:

#+begin_src elisp
(setq org-id-locations-file
      (concat
       (getenv "HOME")
       "/Nextcloud/documents/org/.orgids"))
#+end_src

**** Org-attach custom directory :org:

#+begin_src elisp
(setq org-attach-id-dir
      (concat
       (getenv "HOME")
       "/Nextcloud/documents/org/.attach/"))
#+end_src

**** Org-Cite (oc.el) :org:cite:

