config.org
**** TODO new version

Mon Mar 31 09:50:32 2025
Wed Jun  4 18:28:02 2025

#+begin_quote
  %a          Annotation, normally the link created with org-store-link.
  %A          Like %a, but prompt for the description part.
  %l          Like %a, but only insert the literal link.
  %L          Like %l, but without brackets (the link content itself).
#+end_quote

#+begin_quote
 :prepend            Normally newly captured information will be appended at
                     the target location (last child, last table line,
                     last list item...).  Setting this property will
                     change that.
#+end_quote

Mine:

#+begin_src elisp
(setq org-capture-templates
  '(("t" "Personal todo" entry (file+headline +org-capture-todo-file "Inbox") "* [ ] %?\n%i\n" :prepend t)
    ("n" "Personal notes" entry (file+headline +org-capture-notes-file "Inbox") "* %u %?\n%i\n" :prepend t)
    ("j" "Journal" entry (file+olp+datetree +org-capture-journal-file) "* %U %?\n%i\n" :prepend t)
    ("p" "Templates for projects")
    ("pt" "Project-local todo" entry (file+headline +org-capture-project-todo-file "Inbox") "* TODO %?\n%i\n%a" :prepend t)
    ("pn" "Project-local notes" entry (file+headline +org-capture-project-notes-file "Inbox") "* %U %?\n%i\n%a" :prepend t)
    ("pc" "Project-local changelog" entry (file+headline +org-capture-project-changelog-file "Unreleased") "* %U %?\n%i\n%a" :prepend t)
    ("o" "Centralized templates for projects")
    ("ot" "Project todo" entry #'+org-capture-central-project-todo-file "* TODO %?\n %i\n %a" :heading "Tasks" :prepend nil)
    ("on" "Project notes" entry #'+org-capture-central-project-notes-file "* %U %?\n %i\n %a" :heading "Notes" :prepend t)
    ("oc" "Project changelog" entry #'+org-capture-central-project-changelog-file "* %U %?\n %i\n %a" :heading "Changelog" :prepend t)))
#+end_src

From systemcrafters:

#+begin_example elisp
(defun dw/read-file-as-string (path)
  (with-temp-buffer
    (insert-file-contents path)
    (buffer-string)))
#+end_example


#+begin_example elisp
(setq org-capture-templates
  `(("t" "Tasks / Projects")
    ("tt" "Task" entry (file+olp "~/Projects/Code/emacs-from-scratch/OrgFiles/Tasks.org" "Inbox")
         "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
    ("ts" "Clocked Entry Subtask" entry (clock)
         "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

    ("j" "Journal Entries")
    ("jj" "Journal" entry
         (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
         "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
         ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
         :clock-in :clock-resume
         :empty-lines 1)
    ("jm" "Meeting" entry
         (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
         "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
         :clock-in :clock-resume
         :empty-lines 1)

    ("w" "Workflows")
    ("we" "Checking Email" entry (file+olp+datetree ,(dw/get-todays-journal-file-name))
         "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

    ("m" "Metrics Capture")
    ("mw" "Weight" table-line (file+headline "~/Projects/Code/emacs-from-scratch/OrgFiles/Metrics.org" "Weight")
     "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))
#+end_example

#+begin_quote
Bindings straight to templates
#+end_quote

#+begin_src elisp
(define-key global-map (kbd "C-c j")
  (lambda () (interactive) (org-capture nil "j")))
#+end_src

Habit tracking

#+begin_example elisp
(require 'org-habit)
(add-to-list 'org-modules 'org-habit)
(setq org-habit-graph-column 60)
#+end_example

*** Vulpea Auto-Sync Org Roam v2 todos from dailies :org:roam:vulpea:

#+begin_src elisp
(after! 'org
  (use-package! vulpea
    :hook ((org-roam-db-autosync-mode . vulpea-db-autosync-enable))))
#+end_src

*** Tangle a single block at a time

From [[https://stackoverflow.com/a/39628921][joon]]:

#+begin_src elisp
(defun org-babel-tangle-block ()
  (interactive)
  (let ((current-prefix-arg '(4)))
    (call-interactively 'org-babel-tangle)))

(after! org
  (map! :map org-mode-map
        :prefix "C-c C-v"
        "t" #'org-babel-tangle-block
        "T" #'org-babel-tangle))
#+end_src

**** Tangle a single block from within the special edit menu

From [[https://stackoverflow.com/a/68962704][Dennis Proksch]]:

#+begin_src elisp
(defun org-babel-tangle-from-edit-special ()
    (interactive)
    (org-edit-src-exit)
    (let ((current-prefix-arg '(4)))
      (call-interactively 'org-babel-tangle))
    (org-edit-special))

(after! org
  (map! :map org-src-mode-map
        "<f9>" #'org-babel-tangle-from-edit-special))
#+end_src

Do this: put pointer in a code block -> m ' -> F9 to tangle.

*** Convert markdown buffer to org

#+begin_src elisp
(defun markdown-convert-buffer-to-org ()
  "Convert the current buffer's content from markdown to orgmode format
   and save it with the current buffer's file name but with .org extension."
  (interactive)
  (shell-command-on-region (point-min)
                           (point-max)
                           (format "pandoc -f markdown -t org -o %s"
                                   (concat (file-name-sans-extension
                                            (buffer-file-name)) ".org"))))
#+end_src

*** TODO Custom Command to Show Only DONE Tasks Today

Doesn't work
#+begin_example elisp
(setq org-agenda-custom-commands
      '(("d" "Tasks done today"
         ((agenda ""
                  ((org-agenda-span 'day)
                   (org-agenda-start-with-log-mode t)
                   (org-agenda-log-mode-items '(closed state))
                   ;;(org-agenda-archives-mode t)
                   ))))))
#+end_example

** nasm-mode

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.\\(asm\\|s\\|S\\)$" . nasm-mode))
#+end_src

** Ascii Table

By [[https://www.emacswiki.org/emacs/Rick_Bielawski][Rick Bielawski]] ([[https://www.emacswiki.org/emacs/AsciiTable][EmacsWiki: Ascii Table]]):

#+begin_src elisp
  (defun ascii-table ()
    "Display basic ASCII table (0 thru 128)."
    (interactive)
    (switch-to-buffer "*ASCII*")
    (erase-buffer)
    (setq buffer-read-only nil)        ;; Not need to edit the content, just read mode (added)
    (local-set-key "q" 'bury-buffer)   ;; Nice to have the option to bury the buffer (added)
    (save-excursion (let ((i -1))
      (insert "ASCII characters 0 thru 127.\n\n")
      (insert " Hex  Dec  Char|  Hex  Dec  Char|  Hex  Dec  Char|  Hex  Dec  Char\n")
      (while (< i 31)
        (insert (format "%4x %4d %4s | %4x %4d %4s | %4x %4d %4s | %4x %4d %4s\n"
                        (setq i (+ 1  i)) i (single-key-description i)
                        (setq i (+ 32 i)) i (single-key-description i)
                        (setq i (+ 32 i)) i (single-key-description i)
                        (setq i (+ 32 i)) i (single-key-description i)))
        (setq i (- i 96))))))
#+end_src

** Emacs Relay Chat (~erc~) for Internet Relay Chat (IRC) :irc:

Set user information.

#+begin_src elisp
(setq erc-server "localhost"
      erc-nick "chuthepup"
      erc-user-full-name "Chu the Pup")
#+end_src

** Editing server (~edit-server~) for Emacs with ~edit-with-emacs~

#+begin_src elisp
(require 'edit-server)
(edit-server-start)
#+end_src

** Dictionary

#+begin_src elisp
(after! 'org
  (setq ispell-alternate-dictionary "/usr/share/dict"))
#+end_src

** ~auth-source-save-behavior~

#+begin_src elisp
(setq auth-source-save-behavior nil)
#+end_src

** ~nov.el~ for reading epub files in Emacs

This is a hook to activate the ~nov.el~ mode (nov-mode) whenever you open a file ending in ".epub" within Emacs.

#+begin_src elisp
(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))
#+end_src

** ~dired~ directory editor (Emacs file manager) settings :dired:

*** Have Dired ask to back files up prior to overwriting them.

Make sure you know where your Emacs cache backup directory actually resides before putting this in your Emacs's initialization file (unless you use gio trash, which'll put your trash in $XDG_DATA_DIR/Trash/files).

#+begin_src elisp
;; Ask to back files up prior to overwriting them
(setq dired-backup-overwrite t)
#+end_src

*** Trash instead of delete :dired:

#+begin_src elisp
(setq delete-by-moving-to-trash t)
#+end_src

*** Dired listing style switches

**** Vanilla Emacs default

#+begin_src elisp :tangle no
(setq dired-listing-switches "-al")
#+end_src

**** DOOM Emacs Default

#+begin_src elisp :tangle no
(setq dired-listing-switches "-ahl -v --group-directories-first")
#+end_src

**** Mine

#+begin_src elisp
(setq dired-listing-switches "-hl -v --group-directories-first")
#+end_src

*** Dirvish

#+begin_src elisp
(after! dirvish
  ;; Hide dotfiles by default
  (setq dirvish-listing-switches "-hlv --group-directories-first")

  (defun dirvish-toggle-dotfiles ()
    "Toggle showing dotfiles in Dirvish."
    (interactive)
    (if (string-match-p "\\b-a\\b" dirvish-listing-switches)
        (setq dirvish-listing-switches "-hlv --group-directories-first") ; Hide dotfiles
      (setq dirvish-listing-switches "-ahlv --group-directories-first")) ; Show dotfiles
    (dirvish-refresh))

  (map! :map dirvish-mode-map
        "C-<escape>" #'dirvish-toggle-dotfiles))
#+end_src

** Enable active presence on Discord for Emacs

*WARNING*: This will tell anyone on your Discord your current activity status in Emacs—with a pretty hefty amount of detail as well. [[id:8f9bc104-87a1-4fa4-b624-a5ea64210b8a][Remember: you can do the following if you want to disable something]].

#+begin_src elisp
(use-package! elcord-mode
  :defer t
  :config
  (setq elcord-display-buffer-details nil
        elcord-display-line-numbers nil
        elcord-quiet t
        elcord-mode t))
#+end_src

** emms

#+begin_src elisp
(setq emms-source-beets-database "/run/media/root/grandarchive/root/audio/music/library.db")
#+end_src

** EPG: Letting Emacs query for GPG passwords

Allow Emacs to handle queries for gpg passwords.

#+begin_src elisp
(setq epg-pinentry-mode 'loopback)

(defun pinentry-emacs (desc prompt ok error)
  (let ((str (read-passwd (concat (replace-regexp-in-string "%22" "\""
                                  (replace-regexp-in-string "%0A" "\n" desc)) prompt ": ")))) str))
#+end_src

** Tramp :tramp:ssh:

*** Tramp FTP doesn't read my ~/.authinfo.gpg :tramp:ssh:

Ange-FTP defaults to =~/.netrc=  so you need to add this to your init script:

#+begin_src elisp
(setq ange-ftp-netrc-filename "~/.authinfo.gpg")
#+end_src

