config.el
  '(("t" "Personal todo" entry (file+headline +org-capture-todo-file "Inbox") "* [ ] %?\n%i\n" :prepend t)
    ("n" "Personal notes" entry (file+headline +org-capture-notes-file "Inbox") "* %u %?\n%i\n" :prepend t)
    ("j" "Journal" entry (file+olp+datetree +org-capture-journal-file) "* %U %?\n%i\n" :prepend t)
    ("p" "Templates for projects")
    ("pt" "Project-local todo" entry (file+headline +org-capture-project-todo-file "Inbox") "* TODO %?\n%i\n%a" :prepend t)
    ("pn" "Project-local notes" entry (file+headline +org-capture-project-notes-file "Inbox") "* %U %?\n%i\n%a" :prepend t)
    ("pc" "Project-local changelog" entry (file+headline +org-capture-project-changelog-file "Unreleased") "* %U %?\n%i\n%a" :prepend t)
    ("o" "Centralized templates for projects")
    ("ot" "Project todo" entry #'+org-capture-central-project-todo-file "* TODO %?\n %i\n %a" :heading "Tasks" :prepend nil)
    ("on" "Project notes" entry #'+org-capture-central-project-notes-file "* %U %?\n %i\n %a" :heading "Notes" :prepend t)
    ("oc" "Project changelog" entry #'+org-capture-central-project-changelog-file "* %U %?\n %i\n %a" :heading "Changelog" :prepend t)))

(define-key global-map (kbd "C-c j")
  (lambda () (interactive) (org-capture nil "j")))

(after! 'org
  (use-package! vulpea
    :hook ((org-roam-db-autosync-mode . vulpea-db-autosync-enable))))

(defun org-babel-tangle-block ()
  (interactive)
  (let ((current-prefix-arg '(4)))
    (call-interactively 'org-babel-tangle)))

(after! org
  (map! :map org-mode-map
        :prefix "C-c C-v"
        "t" #'org-babel-tangle-block
        "T" #'org-babel-tangle))

(defun org-babel-tangle-from-edit-special ()
    (interactive)
    (org-edit-src-exit)
    (let ((current-prefix-arg '(4)))
      (call-interactively 'org-babel-tangle))
    (org-edit-special))

(after! org
  (map! :map org-src-mode-map
        "<f9>" #'org-babel-tangle-from-edit-special))

(defun markdown-convert-buffer-to-org ()
  "Convert the current buffer's content from markdown to orgmode format
   and save it with the current buffer's file name but with .org extension."
  (interactive)
  (shell-command-on-region (point-min)
                           (point-max)
                           (format "pandoc -f markdown -t org -o %s"
                                   (concat (file-name-sans-extension
                                            (buffer-file-name)) ".org"))))

(add-to-list 'auto-mode-alist '("\\.\\(asm\\|s\\|S\\)$" . nasm-mode))

(defun ascii-table ()
  "Display basic ASCII table (0 thru 128)."
  (interactive)
  (switch-to-buffer "*ASCII*")
  (erase-buffer)
  (setq buffer-read-only nil)        ;; Not need to edit the content, just read mode (added)
  (local-set-key "q" 'bury-buffer)   ;; Nice to have the option to bury the buffer (added)
  (save-excursion (let ((i -1))
    (insert "ASCII characters 0 thru 127.\n\n")
    (insert " Hex  Dec  Char|  Hex  Dec  Char|  Hex  Dec  Char|  Hex  Dec  Char\n")
    (while (< i 31)
      (insert (format "%4x %4d %4s | %4x %4d %4s | %4x %4d %4s | %4x %4d %4s\n"
                      (setq i (+ 1  i)) i (single-key-description i)
                      (setq i (+ 32 i)) i (single-key-description i)
                      (setq i (+ 32 i)) i (single-key-description i)
                      (setq i (+ 32 i)) i (single-key-description i)))
      (setq i (- i 96))))))

(setq erc-server "localhost"
      erc-nick "chuthepup"
      erc-user-full-name "Chu the Pup")

(require 'edit-server)
(edit-server-start)

(after! 'org
  (setq ispell-alternate-dictionary "/usr/share/dict"))

(setq auth-source-save-behavior nil)

(add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))

;; Ask to back files up prior to overwriting them
(setq dired-backup-overwrite t)

(setq delete-by-moving-to-trash t)

(setq dired-listing-switches "-hl -v --group-directories-first")

(after! dirvish
  ;; Hide dotfiles by default
  (setq dirvish-listing-switches "-hlv --group-directories-first")

  (defun dirvish-toggle-dotfiles ()
    "Toggle showing dotfiles in Dirvish."
    (interactive)
    (if (string-match-p "\\b-a\\b" dirvish-listing-switches)
        (setq dirvish-listing-switches "-hlv --group-directories-first") ; Hide dotfiles
      (setq dirvish-listing-switches "-ahlv --group-directories-first")) ; Show dotfiles
    (dirvish-refresh))

  (map! :map dirvish-mode-map
        "C-<escape>" #'dirvish-toggle-dotfiles))

(use-package! elcord-mode
  :defer t
  :config
  (setq elcord-display-buffer-details nil
        elcord-display-line-numbers nil
        elcord-quiet t
        elcord-mode t))

(setq emms-source-beets-database "/run/media/root/grandarchive/root/audio/music/library.db")

(setq epg-pinentry-mode 'loopback)

(defun pinentry-emacs (desc prompt ok error)
  (let ((str (read-passwd (concat (replace-regexp-in-string "%22" "\""
                                  (replace-regexp-in-string "%0A" "\n" desc)) prompt ": ")))) str))

(setq ange-ftp-netrc-filename "~/.authinfo.gpg")
