config.org
*** Tramp intregration with dirvish :tramp:ssh:dirvish:

#+begin_src elisp
(use-package tramp
  :config
  ;; Enable full-featured Dirvish over TRAMP on certain connections
  ;; https://www.gnu.org/software/tramp/#Improving-performance-of-asynchronous-remote-processes-1.
  (add-to-list 'tramp-connection-properties
               (list (regexp-quote "/ssh:chunix:")
                     "direct-async-process" t))
  ;; Tips to speed up connections
  (setq tramp-verbose 0
        tramp-chunksize 2000
        tramp-use-ssh-controlmaster-options nil))
#+end_src

** Palimpsest prog mode hook

#+begin_src elisp
(use-package! palimpsest-mode
  :hook (prog-mode . palimpsest-mode))
#+end_src

** Common Lisp

*** Common Lisp find file fix for Roswell compatibility :lisp:

#+begin_src elisp
(after! lisp-mode
  (defun +lisp/find-file-in-quicklisp ()
    "Find a file belonging to a library downloaded by Quicklisp."
    (interactive)
    (doom-project-find-file "~/.local/share/roswell/lisp/quicklisp/dists")))
#+end_src

*** ~roswell~ Lisp Sly helper :lisp:roswell:sly:repl:

#+begin_src elisp
(after! lisp-mode
  (load! (expand-file-name "~/.local/share/roswell/helper.el"))
  (setq inferior-lisp-program "ros dynamic-space-size=8000 -Q run"))
#+end_src

*** Common Lisp snippets for ya snippets (require)

#+begin_src elisp
(after! lisp-mode
  (use-package! common-lisp-snippets
  :defer t))
#+end_src

*** Sly completion fix :lisp:

#+begin_src elisp
(after! sly
  (setq sly-complete-symbol-function 'sly-flex-completions))
#+end_src

** C++

#+begin_src elisp
;;(setq c-syntactic-indentation nil)
#+end_src

** ~whisper~ Voice transcription (speech to text)

Personally, I can't get a model other than the ~base~ one to download. I'm an English speaker, so there's no translation services enabled.

The ~num-processors~ function is a part of base Emacs: [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Process-Information.html#index-num_002dprocessors][GNU Emacs Manual 40.6 Process Information]].

#+begin_src elisp
(use-package whisper
  :config
  (setq whisper-install-directory "~/.config/emacs/.local/cache/"
        whisper-model "base"
        whisper-language "en"
        whisper-translate nil
        whisper-use-threads (/ (num-processors) 2))
        ;; turn off after 600 seconds of silence
        whisper-recording-timeout 600)
#+end_src

** company-tabnine
:PROPERTIES:
:ID:       bf00e5e6-33e9-4db7-ab2a-03118c2f2990
:END:

#+begin_src elisp
(after! company
  (setq +lsp-company-backends '(company-tabnine :separate company-capf company-yasnippet))
  (setq company-show-numbers t)
  (setq company-idle-delay 0))
#+end_src

** newline custom

#+begin_src elisp
(defun newline-after-comma-in-parens ()
  "Insert a newline after each comma within the parentheses of the current line and re-indent."
  (interactive)
  (save-excursion
    (let ((start (line-beginning-position))
          (end (line-end-position)))
      (goto-char start)
      (while (re-search-forward ",\\s-*" end t)
        (replace-match ",\n" t t))
      (indent-region start (line-end-position)))))

(map! :n "SPC p ," #'newline-after-comma-in-parens) ;; Bind it to a key, like `SPC p ,`
#+end_src

** hledger/ledger

*** Turn =ledger-mode= into =hledger-mode=

Figuratively, of course.

Requires hledger to be installed.

From https://hledger.org/editors.html#emacs

#+begin_src elisp
(require 'ob-hledger) ;; depends on org-contrib package
(setq ledger-binary-path "hledger.sh"
      ledger-mode-should-check-version nil
      ledger-report-auto-width nil
      ledger-report-links-in-register nil
      ledger-report-native-highlighting-arguments '("--color=always")
      ledger-default-date-string "%Y-%m-%d"
      ledger-source-directory (getenv "LEDGER_FILE")
      ledger-init-file nil
      ;; ledger-init-file-name "~/.ledgerrc"
      ;; ledger-init-file-name "~/.config/ledger/ledgerrc"
      ledger-accounts-file nil
      ledger-schedule-file nil
      ledger-payees-file nil)

(add-to-list 'auto-mode-alist '("\\.hledger\\'" . ledger-mode))
#+end_src

**** hledger.sh script

from https://hledger.org/editors.html#emacs
#+begin_src sh :mkdirp t :tangle ~/.local/bin/hledger.sh :shebang "#!/bin/sh" :eval no
# hledger.sh
# Kudos to acarrico for the original script.

# The script is contingent on ledger-default-date-string
# being set to "%Y-%m-%d", aka ISO date format.

iargs=("$@")
oargs=()
j=0;
date=;
for((i=0; i<${#iargs[@]}; ++i)); do
    case ${iargs[i]} in
        --date-format)
            # drop --date-format and the next arg
            i=$((i+1));
            ;;
        cleared) # for ledger-di
            splay-balance-at-point
            # convert "cleared" to "balance -N -C"
            oargs[j]=balance; oargs[j+1]=-N; oargs[j+2]=-C; j=$((j+3));
            ;;
        xact)
            # convert "xact" to "print --match"
            oargs[j]=print; oargs[j+1]=--match; j=$((j+2));
            # drop xact argument and stash the date argument
            i=$((i+1));
            date=${iargs[i]};
            ;;
        # NOTE: Reconciliation still doesn't work for other reasons
        #       so the following filters/conversions are unnecessary for now.
        # --sort) # for reconcilliation
        #     # drop --sort and the next arg
        #     i=$((i+1));
        #     ;;
        # --uncleared) # for reconcilliation
        #     # convert "--uncleared" to "--unmarked --pending"
        #     oargs[j]=--unmarked; oargs[j+1]=--pending; j=$((j+2))
        #     ;;
        ,*)
            # keep any other args:
            oargs[j]=${iargs[i]};
            j=$((j+1));
            ;;
    esac
done

if test "$date"
then
    # substitute the given date for the old date:
    hledger "${oargs[@]}" | sed "1s/....-..-../$date/"
else
    # echo "${oargs[@]}"
    hledger "${oargs[@]}"
fi
#+end_src

**** [[https://hledger.org/editors.html#misc][Misc]]

A helper to browse TODO tags in the journal:

#+begin_example elisp
(defun journal-todos nil (interactive) (lgrep "TODO:" "current.journal" "~/finance" nil))
#+end_example

**** Use strict account name checking (optional)

#+begin_src elisp
;; (after! 'ledger-mode
;;   (setq ledger-report-use-strict t))
#+end_src

**** custom hledger formatting scripts

#+begin_src elisp
(defvar chu/default-currency "$"
  "Default currency symbol used for formatting amounts.")

(defun chu/ledger-format-number-with-commas (num)
  "Format NUM with commas and two decimals (e.g., 1,234.56)."
  (let* ((str (format "%.2f" num))
         (parts (split-string str "\\."))
         (int-part (car parts))
         (dec-part (cadr parts))
         (int-with-commas
          (replace-regexp-in-string
           "\\B\\(\\d\\{3\\}\\)\\(\\(?:\\d\\{3\\}\\)*\\)" ",\\1" int-part)))
    (concat int-with-commas "." dec-part)))

(defun chu/format-usd (amount)
  "Format AMOUNT as a USD value with commas, 2 decimals, and no space before $."
  (let* ((num (abs amount))
         (sign (if (< amount 0) "-" ""))
         (formatted (chu/ledger-format-number-with-commas num)))
    (format "%s%s%s" sign chu/default-currency formatted)))

(defun chu/ledger-fill-1-xact ()
  "Fill one missing posting in the current transaction with formatted amount."
  (pcase-let* ((`(,total . ,missing-positions) (ledger-post-xact-total))
               (missing-amount (ledger-negate-commodity total))
               (amounts-balance (< (abs (car missing-amount)) 0.0001)))
    (pcase missing-positions
      ('() (unless amounts-balance
             (user-error "Postings do not balance, but no posting to fill")))
      (`(,missing-pos)
       (if amounts-balance
           (user-error "Missing amount but amounts balance already")
         (goto-char missing-pos)
         (insert "  " (chu/format-usd (car missing-amount)))
         (ledger-post-align-xact (point))))
      (_ (user-error "More than one posting with missing amount")))))

(with-eval-after-load 'ledger-mode
  (defun chu/ledger-post-fill (&optional beg end)
    "Fill missing posting amounts.

If region is active, process all transactions in region.
Otherwise, process only the current transaction."
    (interactive (if (use-region-p)
                     (list (region-beginning) (region-end))))
    (save-excursion
      (if (and beg end)
          ;; Region-based processing
          (progn
            (goto-char beg)
            (while (and (< (point) end)
                        (re-search-forward ledger-transaction-start-regexp end t))
              (goto-char (match-beginning 0))
              (chu/ledger-fill-1-xact)
              (ledger-next-xact)))
        ;; Single transaction fallback
        (chu/ledger-fill-1-xact)))))

;; Optional: keybinding for Doom Emacs
(with-eval-after-load 'ledger-mode
  (map! :map ledger-mode-map
        :localleader
        "f" #'chu/ledger-post-fill))
#+end_src

** Achievements in Emacs

#+begin_src elisp
(achievements-mode)
#+end_src

** =parrot-mode=

#+begin_src elisp
(parrot-mode)
#+end_src

** WSL2

*** Setup

**** =wsl_path.py= Setup

#+begin_src python :exec no :tangle no
import os
import sys

file_path = os.path.abspath(sys.argv[-1]).replace("\\", "/").replace("C:", "/mnt/c")

wsl_path_prefix = "//wsl$/Arch/"
if file_path.startswith(wsl_path_prefix):
    file_path = file_path.replace(wsl_path_prefix, "/")

command = "echo " + file_path.strip() + "| clip"
os.system(command)
#+end_src

