config.el

(use-package tramp
  :config
  ;; Enable full-featured Dirvish over TRAMP on certain connections
  ;; https://www.gnu.org/software/tramp/#Improving-performance-of-asynchronous-remote-processes-1.
  (add-to-list 'tramp-connection-properties
               (list (regexp-quote "/ssh:chunix:")
                     "direct-async-process" t))
  ;; Tips to speed up connections
  (setq tramp-verbose 0
        tramp-chunksize 2000
        tramp-use-ssh-controlmaster-options nil))

(use-package! palimpsest-mode
  :hook (prog-mode . palimpsest-mode))

(after! lisp-mode
  (defun +lisp/find-file-in-quicklisp ()
    "Find a file belonging to a library downloaded by Quicklisp."
    (interactive)
    (doom-project-find-file "~/.local/share/roswell/lisp/quicklisp/dists")))

(after! lisp-mode
  (load! (expand-file-name "~/.local/share/roswell/helper.el"))
  (setq inferior-lisp-program "ros dynamic-space-size=8000 -Q run"))

(after! lisp-mode
  (use-package! common-lisp-snippets
  :defer t))

(after! sly
  (setq sly-complete-symbol-function 'sly-flex-completions))

;;(setq c-syntactic-indentation nil)

(use-package whisper
  :config
  (setq whisper-install-directory "~/.config/emacs/.local/cache/"
        whisper-model "base"
        whisper-language "en"
        whisper-translate nil
        whisper-use-threads (/ (num-processors) 2))
        ;; turn off after 600 seconds of silence
        whisper-recording-timeout 600)

(after! company
  (setq +lsp-company-backends '(company-tabnine :separate company-capf company-yasnippet))
  (setq company-show-numbers t)
  (setq company-idle-delay 0))

(defun newline-after-comma-in-parens ()
  "Insert a newline after each comma within the parentheses of the current line and re-indent."
  (interactive)
  (save-excursion
    (let ((start (line-beginning-position))
          (end (line-end-position)))
      (goto-char start)
      (while (re-search-forward ",\\s-*" end t)
        (replace-match ",\n" t t))
      (indent-region start (line-end-position)))))

(map! :n "SPC p ," #'newline-after-comma-in-parens) ;; Bind it to a key, like `SPC p ,`

(require 'ob-hledger) ;; depends on org-contrib package
(setq ledger-binary-path "hledger.sh"
      ledger-mode-should-check-version nil
      ledger-report-auto-width nil
      ledger-report-links-in-register nil
      ledger-report-native-highlighting-arguments '("--color=always")
      ledger-default-date-string "%Y-%m-%d"
      ledger-source-directory (getenv "LEDGER_FILE")
      ledger-init-file nil
      ;; ledger-init-file-name "~/.ledgerrc"
      ;; ledger-init-file-name "~/.config/ledger/ledgerrc"
      ledger-accounts-file nil
      ledger-schedule-file nil
      ledger-payees-file nil)

(add-to-list 'auto-mode-alist '("\\.hledger\\'" . ledger-mode))

;; (after! 'ledger-mode
;;   (setq ledger-report-use-strict t))

(defvar chu/default-currency "$"
  "Default currency symbol used for formatting amounts.")

(defun chu/ledger-format-number-with-commas (num)
  "Format NUM with commas and two decimals (e.g., 1,234.56)."
  (let* ((str (format "%.2f" num))
         (parts (split-string str "\\."))
         (int-part (car parts))
         (dec-part (cadr parts))
         (int-with-commas
          (replace-regexp-in-string
           "\\B\\(\\d\\{3\\}\\)\\(\\(?:\\d\\{3\\}\\)*\\)" ",\\1" int-part)))
    (concat int-with-commas "." dec-part)))

(defun chu/format-usd (amount)
  "Format AMOUNT as a USD value with commas, 2 decimals, and no space before $."
  (let* ((num (abs amount))
         (sign (if (< amount 0) "-" ""))
         (formatted (chu/ledger-format-number-with-commas num)))
    (format "%s%s%s" sign chu/default-currency formatted)))

(defun chu/ledger-fill-1-xact ()
  "Fill one missing posting in the current transaction with formatted amount."
  (pcase-let* ((`(,total . ,missing-positions) (ledger-post-xact-total))
               (missing-amount (ledger-negate-commodity total))
               (amounts-balance (< (abs (car missing-amount)) 0.0001)))
    (pcase missing-positions
      ('() (unless amounts-balance
             (user-error "Postings do not balance, but no posting to fill")))
      (`(,missing-pos)
       (if amounts-balance
           (user-error "Missing amount but amounts balance already")
         (goto-char missing-pos)
         (insert "  " (chu/format-usd (car missing-amount)))
         (ledger-post-align-xact (point))))
      (_ (user-error "More than one posting with missing amount")))))

(with-eval-after-load 'ledger-mode
  (defun chu/ledger-post-fill (&optional beg end)
    "Fill missing posting amounts.

If region is active, process all transactions in region.
Otherwise, process only the current transaction."
    (interactive (if (use-region-p)
                     (list (region-beginning) (region-end))))
    (save-excursion
      (if (and beg end)
          ;; Region-based processing
          (progn
            (goto-char beg)
            (while (and (< (point) end)
                        (re-search-forward ledger-transaction-start-regexp end t))
              (goto-char (match-beginning 0))
              (chu/ledger-fill-1-xact)
              (ledger-next-xact)))
        ;; Single transaction fallback
        (chu/ledger-fill-1-xact)))))

;; Optional: keybinding for Doom Emacs
(with-eval-after-load 'ledger-mode
  (map! :map ledger-mode-map
        :localleader
        "f" #'chu/ledger-post-fill))

(achievements-mode)

(parrot-mode)
