config.org
**** wsl_emacs.py setup

#+begin_src python :exec no :tangle no
import sys
import subprocess
import os
import re

import win32gui


class WindowMgr:
    """Encapsulates some calls to the winapi for window management"""

    def __init__(self):
        """Constructor"""
        self._handle = None

    def find_window(self, class_name, window_name=None):
        """find a window by its class_name"""
        self._handle = win32gui.FindWindow(class_name, window_name)

    def _window_enum_callback(self, hwnd, wildcard):
        """Pass to win32gui.EnumWindows() to check all the opened windows"""
        if re.match(wildcard, str(win32gui.GetWindowText(hwnd))) is not None:
            self._handle = hwnd

    def find_window_wildcard(self, wildcard):
        """find a window whose title matches the wildcard regex"""
        self._handle = None
        win32gui.EnumWindows(self._window_enum_callback, wildcard)

    def set_foreground(self):
        """put the window in the foreground"""
        win32gui.SetForegroundWindow(self._handle)


if __name__ == "__main__":

    file_name = (
        '"' + sys.argv[1] + '"'
        if sys.argv[1].startswith("org-protocol")
        else os.path.abspath(sys.argv[1]).replace("\\", "/").replace("C:", "/mnt/c")
    )

    wsl_path_prefix = "//wsl$/Arch/"
    if file_name.startswith(wsl_path_prefix):
        file_name = file_name.replace(wsl_path_prefix, "/")

    command = " ".join(
        [
            "C:/Windows/System32/wsl.exe",
            "-d",
            "Arch",
            "emacsclient",
            "-n",
            file_name,
        ]
    )
    subprocess.Popen(command, shell=True)

    w = WindowMgr()
    w.find_window_wildcard(".*Doom Emac")
    w.set_foreground()
#+end_src

**** org-protocol registry setup

#+begin_src reg :exec no :tangle no
Windows Registry Editor Version 5.00

[HKEY_CLASSES_ROOT\org-protocol]
@="URL:Org Protocol"
"URL Protocol"=""

[HKEY_CLASSES_ROOT\org-protocol\shell]

[HKEY_CLASSES_ROOT\org-protocol\shell\open]

[HKEY_CLASSES_ROOT\org-protocol\shell\open\command]
@="\"C:\\Users\\lain\\scoop\\apps\\python\\current\\pythonw.exe\" \"C:\\Portables.chu\\emacs-wsl\\wsl_emacs.py\" \"%1\""
#+end_src

*** TODO enable/disable WSL-specific settings

Since this is the 'navi' branch this is (will be?) enabled by default:

#+begin_src elisp :tangle no
;; (defvar IS-WSL t)
#+end_src

*** TODO open links in org-mode in emacs@wsl2 using windows apps

This is done by installing the [[https://github.com/wslutilities/wslu][wslu]] on your wsl2, and then you can config your org-mode by:

#+begin_src elisp
;; "Set org-file-apps based on the system type"
;; (when IS-WSL
  (setq org-file-apps '((remote . emacs)
                        (auto-mode . emacs)
                        (directory . emacs)
                        ("\\.mm\\'" . "wslview \"%s\"")
                        ("\\.x?html?\\'" . "wslview \"%s\"")
                        ("\\.pptx?\\'" . "wslview \"%s\"")
                        ("\\.xlsx?\\'" . "wslview \"%s\"")
                        ("\\.docx?\\'" . "wslview \"%s\"")
                        ("\\.pdf\\'" .  "wslview \"%s\"")))
  ;; need to set explorer for open weblinks and htmls seperately
  (setq browse-url-generic-program "/mnt/c/Program Files/Mozilla Firefox/firefox.exe")
;; )
#+end_src

*** TODO fix keyboard shortcut for C-shift-0

#+begin_src elisp
;; Windows 10 blocks Ctrl-Shift-0, So we using powertoy to cheat the system
;; when we press "C-)", it becomes "C->"
;; (cond (IS-WSL (map! "C->" #'sp-forward-slurp-sexp))
;;       (t (map! "C-)" #'sp-forward-slurp-sexp)))
#+end_src

*** TODO share clipboard between windows host and WSL2
:PROPERTIES:
:ID:       723b4e62-7315-4dd4-8515-7ca2748220b2
:END:

#+begin_src elisp
(defun win2wsl-clipped-image()
  "use powershell to save the clipped image to wsl and load it to xclip"
  (let* ((powershell "/mnt/c/Windows/System32/WindowsPowerShell/v1.0/powershell.exe")
         (file-name "//wsl$/Arch/home/chu/tmp/clip_win2wsl.png")
         (file-name-wsl "~/tmp/clip_win2wsl.png")
         )
    (shell-command (concat powershell " -noprofile -command \"(Get-Clipboard -Format Image).Save(\\\"" file-name "\\\")\""))
    (call-process-shell-command (concat "xclip -selection clipboard -t image/png -i " file-name-wsl))
    )
  )
(advice-add 'org-download-clipboard :before #'win2wsl-clipped-image)
#+end_src

* Works Cited

** [[https://gergely.polonkai.eu/blog/2014/10/7/rounding-numbers-to-n-decimals-in-emacs.html][Rounding numbers to N decimals in Emacs]]

by Gergely Polonkai.

** https://blog.lazkani.io/posts/bookmark-with-org-capture/

** https://orgmode.org/manual/Capture-templates.html

** [[https://raw.githubusercontent.com/gilbertw1/emacs-literate-starter/master/emacs.org][DOOM Emacs Literate Config]]

By Gilbert. Thanks, Gilbert.

** [[https://github.com/alphapapa/unpackaged.el#ensure-blank-lines-between-headings-and-before-contents][alphapapa/unpackaged.el: A collection of useful Emacs Lisp code that isn't substantial enough to be packaged]]

This is where the '~ap/org-fix-blank-lines~' function was sourced from.

By alphapapa. Thanks, alphapapa.

** [[https://stackoverflow.com/a/35475878/259187][org-archive-subtree-hierarchical.el v0.2]]

By [[https://gist.github.com/kepi/2f4acc3cc93403c75fbba5684c5d852d][Kepi]]. Thanks, Kepi.

*** [[https://lists.gnu.org/archive/html/emacs-orgmode/2014-08/msg00109.html][org-archive-subtree-hierarchical.el v0.1]]

By [[https://lists.gnu.org/archive/html/emacs-orgmode/2014-08/msg00109.html][Florian Adamsky]]. Thanks, Florian Adamsky.

** System Crafters

Thanks, David!

*** [[https://www.youtube.com/watch?v=3-sLBaJAtew][Org Roam: The Best Way to Keep a Journal in Emacs - YouTube]]
